## Plan for scanners/owasp-zap
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 3 to add, 3 to change, 3 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.zap_runner_container_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "zap_runner_container_policies"  {
      ~ id      = "3523795012" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:507252742351:function:scan-websites*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:507252742351:log-group:/aws/ecs/runners_owasp_zap_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:507252742351:log-group:/aws/ecs/runners_owasp_zap_ecs",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ec2:DeleteNetworkInterface",
                          - "ec2:CreateNetworkInterface",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ec2:ca-central-1:507252742351:network-interface/*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ec2:DescribeNetworkInterfaces"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:PutObjectAcl",
                          - "s3:PutObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::scan-websites-owasp-zap-report-data"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:s3:::scan-websites-owasp-zap-report-data",
              ~ (known after apply),
            ]
            # (2 unchanged attributes hidden)
        }
    }

  # data.aws_iam_policy_document.zap_runner_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "zap_runner_policies"  {
      ~ id      = "1103146554" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:507252742351:log-group:/aws/ecs/runners_owasp_zap_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:507252742351:log-group:/aws/ecs/runners_owasp_zap_ecs",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForlayer",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ca-central-1:507252742351:repository/scan-websites/scanners/owasp-zap"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecs:RunTask",
                          - "ecs:DescribeTaskDefinition",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecs:ca-central-1:507252742351:task-definition/runners-owasp-zap:1"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::507252742351:role/security_tools_execution_role",
                          - "arn:aws:iam::507252742351:role/container_execution_role",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:ecs:ca-central-1:507252742351:task-definition/runners-owasp-zap:1",
              ~ (known after apply),
            ]
            # (2 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # data.template_file.scanning_tools will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "scanning_tools"  {
      ~ id       = "370dfea191128527d4d5692a34d4991e27f3fdb765b14aef8c2903717c79d1d0" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "S3_BUCKET"
                          - value = "scan-websites-owasp-zap-report-data"
                        },
                      - {
                          - name  = "ZAP_PORT"
                          - value = "8080"
                        },
                    ]
                  - essential        = true
                  - image            = "507252742351.dkr.ecr.ca-central-1.amazonaws.com/scan-websites/runners/owasp-zap:latest"
                  - linuxParameters  = {
                      - capabilities = {
                          - add  = [
                              - "SYS_PTRACE",
                            ]
                          - drop = null
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/runners_owasp_zap_ecs"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-runners-owasp-zap"
                        }
                    }
                  - mountPoints      = []
                  - name             = "runners-owasp-zap"
                  - portMappings     = [
                      - {
                          - containerPort = 8001
                          - hostPort      = 8001
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = []
                },
              - {
                  - command          = [
                      - "zap.sh",
                      - "-daemon",
                      - "-host",
                      - "0.0.0.0",
                      - "-port",
                      - "8080",
                      - "-config",
                      - "api.disablekey=true",
                      - "-config",
                      - "api.addrs.addr.name=.*",
                      - "-config",
                      - "api.addrs.addr.regex=true",
                    ]
                  - cpu              = 1024
                  - environment      = []
                  - essential        = true
                  - image            = "owasp/zap2docker-stable"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/runners_owasp_zap_ecs"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-runners-owasp-zap"
                        }
                    }
                  - memory           = 3072
                  - mountPoints      = []
                  - name             = "zap2docker"
                  - portMappings     = [
                      - {
                          - containerPort = 8080
                          - hostPort      = 8080
                          - protocol      = "tcp"
                        },
                      - {
                          - containerPort = 8090
                          - hostPort      = 8090
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply)
      ~ vars     = {
          ~ "s3_name"               = "scan-websites-owasp-zap-report-data" -> (known after apply)
            # (5 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_ecs_task_definition.runners-owasp-zap must be replaced
-/+ resource "aws_ecs_task_definition" "runners-owasp-zap" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:507252742351:task-definition/runners-owasp-zap:1" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "S3_BUCKET"
                          - value = "scan-websites-owasp-zap-report-data"
                        },
                      - {
                          - name  = "ZAP_PORT"
                          - value = "8080"
                        },
                    ]
                  - essential        = true
                  - image            = "507252742351.dkr.ecr.ca-central-1.amazonaws.com/scan-websites/runners/owasp-zap:latest"
                  - linuxParameters  = {
                      - capabilities = {
                          - add = [
                              - "SYS_PTRACE",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/runners_owasp_zap_ecs"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-runners-owasp-zap"
                        }
                    }
                  - mountPoints      = []
                  - name             = "runners-owasp-zap"
                  - portMappings     = [
                      - {
                          - containerPort = 8001
                          - hostPort      = 8001
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = []
                },
              - {
                  - command          = [
                      - "zap.sh",
                      - "-daemon",
                      - "-host",
                      - "0.0.0.0",
                      - "-port",
                      - "8080",
                      - "-config",
                      - "api.disablekey=true",
                      - "-config",
                      - "api.addrs.addr.name=.*",
                      - "-config",
                      - "api.addrs.addr.regex=true",
                    ]
                  - cpu              = 1024
                  - environment      = []
                  - essential        = true
                  - image            = "owasp/zap2docker-stable"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/runners_owasp_zap_ecs"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-runners-owasp-zap"
                        }
                    }
                  - memory           = 3072
                  - mountPoints      = []
                  - name             = "zap2docker"
                  - portMappings     = [
                      - {
                          - containerPort = 8080
                          - hostPort      = 8080
                          - protocol      = "tcp"
                        },
                      - {
                          - containerPort = 8090
                          - hostPort      = 8090
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "runners-owasp-zap" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
        tags                     = {
            "CostCentre" = "scan-websites-production"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_iam_policy.scanners-owasp-zap will be updated in-place
  ~ resource "aws_iam_policy" "scanners-owasp-zap" {
        id        = "arn:aws:iam::507252742351:policy/scan-websites-scanners-owasp-zap"
        name      = "scan-websites-scanners-owasp-zap"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:507252742351:log-group:/aws/ecs/runners_owasp_zap_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:507252742351:log-group:/aws/ecs/runners_owasp_zap_ecs",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForlayer",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ca-central-1:507252742351:repository/scan-websites/scanners/owasp-zap"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecs:RunTask",
                          - "ecs:DescribeTaskDefinition",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecs:ca-central-1:507252742351:task-definition/runners-owasp-zap:1"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::507252742351:role/security_tools_execution_role",
                          - "arn:aws:iam::507252742351:role/container_execution_role",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.zap_runner_policies will be updated in-place
  ~ resource "aws_iam_policy" "zap_runner_policies" {
        id        = "arn:aws:iam::507252742351:policy/OWASPZapTaskExecutionPolicies"
        name      = "OWASPZapTaskExecutionPolicies"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:507252742351:function:scan-websites*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:507252742351:log-group:/aws/ecs/runners_owasp_zap_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:507252742351:log-group:/aws/ecs/runners_owasp_zap_ecs",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ec2:DeleteNetworkInterface",
                          - "ec2:CreateNetworkInterface",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ec2:ca-central-1:507252742351:network-interface/*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ec2:DescribeNetworkInterfaces"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:PutObjectAcl",
                          - "s3:PutObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::scan-websites-owasp-zap-report-data"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_function.scanners-owasp-zap will be updated in-place
  ~ resource "aws_lambda_function" "scanners-owasp-zap" {
        id                             = "scanners-owasp-zap"
        tags                           = {}
        # (17 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CLUSTER"            = "arn:aws:ecs:ca-central-1:507252742351:cluster/scanning-tools"
              - "PRIVATE_SUBNETS"    = "subnet-0c3abcc29d00b8589,subnet-0d16dd34a0f0a4589,subnet-0e48adc704a15a982"
              - "REPORT_DATA_BUCKET" = "scan-websites-owasp-zap-report-data"
              - "SECURITY_GROUP"     = "sg-0711e8c6c24e225c7"
              - "TASK_DEF_ARN"       = "arn:aws:ecs:ca-central-1:507252742351:task-definition/runners-owasp-zap:1"
            } -> (known after apply)
        }


        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket.owasp-zap-report-data will be destroyed
  - resource "aws_s3_bucket" "owasp-zap-report-data" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::scan-websites-owasp-zap-report-data" -> null
      - bucket                      = "scan-websites-owasp-zap-report-data" -> null
      - bucket_domain_name          = "scan-websites-owasp-zap-report-data.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "scan-websites-owasp-zap-report-data.s3.ca-central-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z1QDHH18159H29" -> null
      - id                          = "scan-websites-owasp-zap-report-data" -> null
      - region                      = "ca-central-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "CostCenter" = "scan-websites"
        } -> null
      - tags_all                    = {
          - "CostCenter" = "scan-websites"
        } -> null

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket_public_access_block.owasp-zap-report-data will be destroyed
  - resource "aws_s3_bucket_public_access_block" "owasp-zap-report-data" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "scan-websites-owasp-zap-report-data" -> null
      - id                      = "scan-websites-owasp-zap-report-data" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # module.owasp_zap_report_data.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "scan-websites-production-owasp-zap-report-data"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + logging {
          + target_bucket = "scan-websites-production-logs"
          + target_prefix = "scan-websites-production-owasp-zap-report-data"
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.owasp_zap_report_data.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 3 to add, 3 to change, 3 to destroy.

Changes to Outputs:
  ~ owasp_zap_report_data_bucket_id = "scan-websites-owasp-zap-report-data" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>